Revit 2027 API
ParameterTypeId.RebarSystemBarTypeTopDir1Generic Property
 "Top/Exterior Major Bar Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemBarTypeTopDir1Generic { get; }
Public Shared ReadOnly Property RebarSystemBarTypeTopDir1Generic As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemBarTypeTopDir1Generic {
	ForgeTypeId^ get ();
}
static member RebarSystemBarTypeTopDir1Generic : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace